SimulationsDatabase/CurvedBackwardStep/Template/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       41710;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          140;
        startFace       41850;
    }
    inlet
    {
        type            patch;
        nFaces          150;
        startFace       41990;
    }
    outlet
    {
        type            patch;
        nFaces          150;
        startFace       42140;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          42000;
        startFace       42290;
    }
)

// ************************************************************************* //
