SimulationsDatabase/CurvedBackwardStep/Template/system/stressComponents
type            turbulenceFields;
libs            (fieldFunctionObjects);

writeControl    writeTime;

fields          (devReff);
